Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_dma.h
/**
  *******************************************************************************************************
  * @file    fm33fg5xxa_fl_dma.h
  * @author  FMSH Application Team
  * @brief   Head file of DMA FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG5XX_FL_DMA_H
#define __FM33FG5XX_FL_DMA_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33ld5xx_fl_def.h"
/** @addtogroup FM33LD5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup DMA_FL_ES_INIT DMA Exported Init structures
  * @{
  */

/**
  * @brief FL DMA Init Sturcture definition
  */
typedef struct
{
    /* DMA外设映射地址(外设请求源:0~127)*/
    uint32_t periphAddress;
    /*! DMA传输方向 */
    uint32_t direction;
    /*! RAM地址增长方向 */
    uint32_t memoryAddressIncMode;
    /*! 外设地址增长方向 */
    uint32_t peripheralAddressIncMode;
    /*! DAM传输通道数据位宽 */
    uint32_t dataSize;
    /*! DMA通道优先级 */
    uint32_t priority;
    /*! 循环模式使能 */
    uint32_t circMode;
    /*! 双缓冲区模式使能 */
    uint32_t dbufMode;

} FL_DMA_InitTypeDef;

/**
  * @brief FL DMA Config Sturcture definition
  */
typedef struct
{
    /*! 外设地址 */
    uint32_t peripheralAddress;
    /*! RAM0地址 */
    uint32_t memoryAddress0;
    /*! RAM1地址 */
    uint32_t memoryAddress1;
    /*! DMA传输数据字节个数 */
    uint32_t transmissionCount;

} FL_DMA_ConfigTypeDef;

/**
  * @brief Configuration with temporary structure variable users will not be used directly
  */
typedef struct
{
    __IO uint32_t CHCR;
    __IO uint32_t CFGR;
    __IO uint32_t PAR;
    __IO uint32_t CHMAD0;
    __IO uint32_t CHMAD1;
    __IO uint32_t RSV[3];
} CHANNEL;

/**
  * @brief Configuration with temporary structure variable users will not be used directly
  */
typedef struct
{
    __IO CHANNEL  Channel[7];
    __IO uint32_t DMA_CH7CR;
    __IO uint32_t CH7FLSAD;
    __IO uint32_t CH7MAD;
    __IO uint32_t RSV5[69];               /*!<  RESERVED REGISTER,                                    Address offset: 0xEC */
    __IO uint32_t DMA_GCR;                    /*!<  DMA Global Control Register,                          Address offset: 0x200 */
    __IO uint32_t SWRR;                   /*!<  DMA Software Request Register,                        Address offset: 0x204 */
    __IO uint32_t RSV6[62];               /*!<  RESERVED REGISTER,                                    Address offset: 0x208 */
    __IO uint32_t ISR;                    /*!<  DMA Interrupt Status Register,                        Address offset: 0x300 */
    __I  uint32_t TFSADDR[7];             /*!<  ,                                                     Address offset: 0x304 */
} DMA_ADDR;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup DMA_FL_Exported_Constants DMA Exported Constants
  * @{
  */

#define    DMA_CHCR_MINC_Pos                                      (6U)
#define    DMA_CHCR_MINC_Msk                                      (0x3U << DMA_CHCR_MINC_Pos)
#define    DMA_CHCR_MINC                                          DMA_CHCR_MINC_Msk

#define    DMA_CHCR_PINC_Pos                                      (4U)
#define    DMA_CHCR_PINC_Msk                                      (0x3U << DMA_CHCR_PINC_Pos)
#define    DMA_CHCR_PINC                                          DMA_CHCR_PINC_Msk

#define    DMA_CHCR_DBUF_Pos                                      (3U)
#define    DMA_CHCR_DBUF_Msk                                      (0x1U << DMA_CHCR_DBUF_Pos)
#define    DMA_CHCR_DBUF                                          DMA_CHCR_DBUF_Msk

#define    DMA_CHCR_EN_Pos                                        (0U)
#define    DMA_CHCR_EN_Msk                                        (0x1U << DMA_CHCR_EN_Pos)
#define    DMA_CHCR_EN                                            DMA_CHCR_EN_Msk

#define    DMA_CFGR_TSIZE_Pos                                     (16U)
#define    DMA_CFGR_TSIZE_Msk                                     (0xffffU << DMA_CFGR_TSIZE_Pos)
#define    DMA_CFGR_TSIZE                                         DMA_CFGR_TSIZE_Msk

#define    DMA_CFGR_SUSP_Pos                                      (15U)
#define    DMA_CFGR_SUSP_Msk                                      (0x1U << DMA_CFGR_SUSP_Pos)
#define    DMA_CFGR_SUSP                                          DMA_CFGR_SUSP_Msk

#define    DMA_CFGR_RSEL_Pos                                      (8U)
#define    DMA_CFGR_RSEL_Msk                                      (0x7fU << DMA_CFGR_RSEL_Pos)
#define    DMA_CFGR_RSEL                                          DMA_CFGR_RSEL_Msk

#define    DMA_CFGR_PRI_Pos                                       (6U)
#define    DMA_CFGR_PRI_Msk                                       (0x3U << DMA_CFGR_PRI_Pos)
#define    DMA_CFGR_PRI                                           DMA_CFGR_PRI_Msk

#define    DMA_CFGR_BDW_Pos                                       (4U)
#define    DMA_CFGR_BDW_Msk                                       (0x3U << DMA_CFGR_BDW_Pos)
#define    DMA_CFGR_BDW                                           DMA_CFGR_BDW_Msk

#define    DMA_CFGR_CIRC_Pos                                      (3U)
#define    DMA_CFGR_CIRC_Msk                                      (0x1U << DMA_CFGR_CIRC_Pos)
#define    DMA_CFGR_CIRC                                          DMA_CFGR_CIRC_Msk

