Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_dma.h
#define    DMA_CFGR_FTIE_Pos                                      (2U)
#define    DMA_CFGR_FTIE_Msk                                      (0x1U << DMA_CFGR_FTIE_Pos)
#define    DMA_CFGR_FTIE                                          DMA_CFGR_FTIE_Msk

#define    DMA_CFGR_HTIE_Pos                                      (1U)
#define    DMA_CFGR_HTIE_Msk                                      (0x1U << DMA_CFGR_HTIE_Pos)
#define    DMA_CFGR_HTIE                                          DMA_CFGR_HTIE_Msk

#define    DMA_CFGR_DIR_Pos                                       (0U)
#define    DMA_CFGR_DIR_Msk                                       (0x1U << DMA_CFGR_DIR_Pos)
#define    DMA_CFGR_DIR                                            DMA_CFGR_DIR_Msk

#define    DMA_DMA_CH7CR_PRI_Pos                                  (12U)
#define    DMA_DMA_CH7CR_PRI_Msk                                  (0x3U << DMA_DMA_CH7CR_PRI_Pos)
#define    DMA_DMA_CH7CR_PRI                                      DMA_DMA_CH7CR_PRI_Msk

#define    DMA_CH7CR_DIR_Pos                                      (10U)
#define    DMA_DMA_CH7CR_DIR_Msk                                  (0x1UL << DMA_CH7CR_DIR_Pos)
#define    DMA_DMA_CH7CR_DIR                                      DMA_DMA_CH7CR_DIR_Msk

#define    DMA_CH7CR_RINC_Pos                                     (9U)
#define    DMA_DMA_CH7CR_RINC_Msk                                 (0x1U << DMA_CH7CR_RINC_Pos)
#define    DMA_DMA_CH7CR_RINC                                     DMA_DMA_CH7CR_RINC_Msk

#define    DMA_CH7CR_FINC_Pos                                     (8U)
#define    DMA_DMA_CH7CR_FINC_Msk                                 (0x1U << DMA_CH7CR_FINC_Pos)
#define    DMA_DMA_CH7CR_FINC                                     DMA_DMA_CH7CR_FINC_Msk

#define    DMA_GCR_ADDRERR_IE_Pos                                 (1U)
#define    DMA_GCR_ADDRERR_IE_Msk                                 (0x1U << DMA_GCR_ADDRERR_IE_Pos)
#define    DMA_GCR_ADDRERR_IE                                     DMA_GCR_ADDRERR_IE_Msk

#define    DMA_GCR_EN_Pos                                         (0U)
#define    DMA_GCR_EN_Msk                                         (0x1U << DMA_GCR_EN_Pos)
#define    DMA_GCR_EN                                             DMA_GCR_EN_Msk

#define    DMA_ISR_CHFT_Pos                                       (8U)
#define    DMA_ISR_CHFT_Msk                                       (0x1U << DMA_ISR_CHFT_Pos)
#define    DMA_ISR_CHFT                                           DMA_ISR_CHFT_Msk

#define    DMA_ISR_CHHT_Pos                                       (0U)
#define    DMA_ISR_CHHT_Msk                                       (0x1U << DMA_ISR_CHHT_Pos)
#define    DMA_ISR_CHHT                                           DMA_ISR_CHHT_Msk

#define    FL_DMA_CHANNEL_0                                       (0x0U << 0U)
#define    FL_DMA_CHANNEL_1                                       (0x1U << 0U)
#define    FL_DMA_CHANNEL_2                                       (0x2U << 0U)
#define    FL_DMA_CHANNEL_3                                       (0x3U << 0U)
#define    FL_DMA_CHANNEL_4                                       (0x4U << 0U)
#define    FL_DMA_CHANNEL_5                                       (0x5U << 0U)
#define    FL_DMA_CHANNEL_6                                       (0x6U << 0U)
#define    FL_DMA_CHANNEL_7                                       (0x7U << 0U)

#define    FL_DMA_MEMORY_INC_MODE_NOCHANGE                        (0x0U << DMA_CHCR_MINC_Pos)
#define    FL_DMA_MEMORY_INC_MODE_INCREASE                        (0x1U << DMA_CHCR_MINC_Pos)
#define    FL_DMA_MEMORY_INC_MODE_DECREASE                        (0x2U << DMA_CHCR_MINC_Pos)

#define    FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE                    (0x0U << DMA_CHCR_PINC_Pos)
#define    FL_DMA_PERIPHERAL_INC_MODE_INCREASE                    (0x1U << DMA_CHCR_PINC_Pos)
#define    FL_DMA_PERIPHERAL_INC_MODE_DECREASE                    (0x2U << DMA_CHCR_PINC_Pos)

#define    FL_DMA_CHANNEL_SPI0_RX                                 (0x0U)
#define    FL_DMA_CHANNEL_SPI1_RX                                 (0x1U)
#define    FL_DMA_CHANNEL_SPI2_RX                                 (0x2U)
#define    FL_DMA_CHANNEL_SPI0_TX                                 (0x6U)
#define    FL_DMA_CHANNEL_SPI1_TX                                 (0x7U)
#define    FL_DMA_CHANNEL_SPI2_TX                                 (0x8U)
#define    FL_DMA_CHANNEL_UART0_RX                                (0xcU)
#define    FL_DMA_CHANNEL_UART1_RX                                (0xdU)
#define    FL_DMA_CHANNEL_UART2_RX                                (0xeU)
#define    FL_DMA_CHANNEL_UART3_RX                                (0xfU)
#define    FL_DMA_CHANNEL_UART4_RX                                (0x10U)
#define    FL_DMA_CHANNEL_UART5_RX                                (0x11U)
#define    FL_DMA_CHANNEL_UART0_TX                                (0x17U)
#define    FL_DMA_CHANNEL_UART1_TX                                (0x18U)
#define    FL_DMA_CHANNEL_UART2_TX                                (0x19U)
#define    FL_DMA_CHANNEL_UART3_TX                                (0x1aU)
#define    FL_DMA_CHANNEL_UART4_TX                                (0x1bU)
#define    FL_DMA_CHANNEL_UART5_TX                                (0x1cU)
#define    FL_DMA_CHANNEL_CRC                                     (0x33U)
#define    FL_DMA_CHANNEL_QSPI                                    (0x34U)
#define    FL_DMA_CHANNEL_ATIM0_CH1                               (0x35U)
#define    FL_DMA_CHANNEL_ATIM0_CH2                               (0x36U)
#define    FL_DMA_CHANNEL_ATIM0_CH3                               (0x37U)
#define    FL_DMA_CHANNEL_ATIM0_CH4                               (0x38U)
#define    FL_DMA_CHANNEL_ATIM0_TRIG                              (0x39U)
#define    FL_DMA_CHANNEL_ATIM0_COM                               (0x3aU)
#define    FL_DMA_CHANNEL_ATIM0_UEV                               (0x3bU)
#define    FL_DMA_CHANNEL_ATIM1_CH1                               (0x3cU)
#define    FL_DMA_CHANNEL_ATIM1_CH2                               (0x3dU)
#define    FL_DMA_CHANNEL_ATIM1_CH3                               (0x3eU)
#define    FL_DMA_CHANNEL_ATIM1_CH4                               (0x3fU)
#define    FL_DMA_CHANNEL_ATIM1_TRIG                              (0x40U)
#define    FL_DMA_CHANNEL_ATIM1_COM                               (0x41U)
#define    FL_DMA_CHANNEL_ATIM1_UEV                               (0x42U)
#define    FL_DMA_CHANNEL_ATIM2_CH1                               (0x43U)
#define    FL_DMA_CHANNEL_ATIM2_CH2                               (0x44U)
#define    FL_DMA_CHANNEL_ATIM2_CH3                               (0x45U)
#define    FL_DMA_CHANNEL_ATIM2_CH4                               (0x46U)
#define    FL_DMA_CHANNEL_ATIM2_TRIG                              (0x47U)
#define    FL_DMA_CHANNEL_ATIM2_COM                               (0x48U)
#define    FL_DMA_CHANNEL_ATIM2_UEV                               (0x49U)
#define    FL_DMA_CHANNEL_GPTIM0_CH1                              (0x4aU)
#define    FL_DMA_CHANNEL_GPTIM0_CH2                              (0x4bU)
#define    FL_DMA_CHANNEL_GPTIM0_CH3                              (0x4cU)
#define    FL_DMA_CHANNEL_GPTIM0_CH4                              (0x4dU)
#define    FL_DMA_CHANNEL_GPTIM0_TRIG                             (0x4eU)
#define    FL_DMA_CHANNEL_GPTIM0_UEV                              (0x4fU)
#define    FL_DMA_CHANNEL_GPTIM1_CH1                              (0x50U)
#define    FL_DMA_CHANNEL_GPTIM1_CH2                              (0x51U)
#define    FL_DMA_CHANNEL_GPTIM1_CH3                              (0x52U)
#define    FL_DMA_CHANNEL_GPTIM1_CH4                              (0x53U)
#define    FL_DMA_CHANNEL_GPTIM1_TRIG                             (0x54U)
#define    FL_DMA_CHANNEL_GPTIM1_UEV                              (0x55U)
#define    FL_DMA_CHANNEL_GPTIM5_CH1                              (0x56U)
#define    FL_DMA_CHANNEL_GPTIM5_CH2                              (0x57U)
#define    FL_DMA_CHANNEL_GPTIM5_CH3                              (0x58U)
#define    FL_DMA_CHANNEL_GPTIM5_CH4                              (0x59U)
#define    FL_DMA_CHANNEL_GPTIM5_TRIG                             (0x5aU)
#define    FL_DMA_CHANNEL_GPTIM5_UEV                              (0x5bU)
#define    FL_DMA_CHANNEL_TAU0_0                                  (0x5cU)
#define    FL_DMA_CHANNEL_TAU0_1                                  (0x5dU)
#define    FL_DMA_CHANNEL_TAU0_2                                  (0x5eU)
#define    FL_DMA_CHANNEL_TAU0_3                                  (0x5fU)
#define    FL_DMA_CHANNEL_BSTIM0_TRIG                             (0x62U)
#define    FL_DMA_CHANNEL_LPTIM0_TRIG                             (0x63U)
#define    FL_DMA_CHANNEL_ADC0_COMB                               (0x6fU)
#define    FL_DMA_CHANNEL_ADC0_SACQ                               (0x70U)
#define    FL_DMA_CHANNEL_ADC1_COMB                               (0x71U)
#define    FL_DMA_CHANNEL_ADC1_SACQ                               (0x72U)
#define    FL_DMA_CHANNEL_ADC2_COMB                               (0x73U)
#define    FL_DMA_CHANNEL_ADC2_SACQ                               (0x74U)
#define    FL_DMA_CHANNEL_ADC3_COMB                               (0x75U)
#define    FL_DMA_CHANNEL_ADC3_SACQ                               (0x76U)
#define    FL_DMA_CHANNEL_DAC0                                    (0x77U)
#define    FL_DMA_CHANNEL_DAC1                                    (0x78U)
#define    FL_DMA_CHANNEL_CORDIC_INA                              (0x79U)
#define    FL_DMA_CHANNEL_CORDIC_INB                              (0x7aU)
#define    FL_DMA_CHANNEL_CORDIC_OUT                              (0x7bU)
#define    FL_DMA_CHANNEL_SWTRIG                                  (0x7fU)

#define    FL_DMA_PRIORITY_LOW                                    (0x0U)
#define    FL_DMA_PRIORITY_MEDIUM                                 (0x1U)
#define    FL_DMA_PRIORITY_HIGH                                   (0x2U)
#define    FL_DMA_PRIORITY_VERYHIGH                               (0x3U)

