Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_dma.h
#define    FL_DMA_BANDWIDTH_8B                                    (0x0U << DMA_CFGR_BDW_Pos)
#define    FL_DMA_BANDWIDTH_16B                                   (0x1U << DMA_CFGR_BDW_Pos)
#define    FL_DMA_BANDWIDTH_32B                                   (0x2U << DMA_CFGR_BDW_Pos)

#define    FL_DMA_DIR_PERIPHERAL_TO_RAM                           (0x0U << DMA_CFGR_DIR_Pos)
#define    FL_DMA_DIR_RAM_TO_PERIPHERAL                           (0x1U << DMA_CFGR_DIR_Pos)
#define    FL_DMA_DIR_FLASH_TO_RAM                                (0x1U << DMA_CH7CR_DIR_Pos)
#define    FL_DMA_DIR_RAM_TO_FLASH                                (0x0U << DMA_CH7CR_DIR_Pos)

#define    FL_DMA_CH7_RAM_INC_MODE_INCREASE                       (0x1U << DMA_CH7CR_RINC_Pos)
#define    FL_DMA_CH7_RAM_INC_MODE_DECREASE                       (0x0U << DMA_CH7CR_RINC_Pos)

#define    FL_DMA_CH7_FLASH_INC_MODE_INCREASE                     (0x1U << DMA_CH7CR_FINC_Pos)
#define    FL_DMA_CH7_FLASH_INC_MODE_DECREASE                     (0x0U << DMA_CH7CR_FINC_Pos)

#define    FL_DMA_TRIGGER_CHANNEL_0                               (0x1U )
#define    FL_DMA_TRIGGER_CHANNEL_1                               (0x2U )
#define    FL_DMA_TRIGGER_CHANNEL_2                               (0x4U )
#define    FL_DMA_TRIGGER_CHANNEL_3                               (0x8U )
#define    FL_DMA_TRIGGER_CHANNEL_4                               (0x10U )
#define    FL_DMA_TRIGGER_CHANNEL_5                               (0x20U )
#define    FL_DMA_TRIGGER_CHANNEL_6                               (0x40U )

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup DMA_FL_Exported_Functions DMA Exported Functions
  * @{
  */

/**
  * @brief    Set channelx RAM address incremental
  * @rmtoll   CHCR    MINC    FL_DMA_SetRamIncrementMode

  * @param    DMAx DMA instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_NOCHANGE
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetMemoryIncrementMode(DMA_Type *DMAx, uint32_t mode, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[channel].CHCR, (0x3U << 6U), mode);
    }
}

/**
  * @brief    Get channelx RAM address incremental status
  * @rmtoll   CHCR    MINC    FL_DMA_GetRamIncrementMode
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_NOCHANGE
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
  */
__STATIC_INLINE uint32_t FL_DMA_GetRamIncrementMode(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, (0x3U << 6U)) >> 6U);
    }
    return 0;
}

/**
  * @brief    Set channelx Peripheral address incremental
  * @rmtoll   CHCR    PINC    FL_DMA_SetPeripheralIncrementMode

  * @param    DMAx DMA instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_DECREASE
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetPeripheralIncrementMode(DMA_Type *DMAx, uint32_t mode, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[channel].CHCR, (0x3U << 4U), mode);
    }
}

/**
  * @brief    Get channelx Peripheral address incremental status
  * @rmtoll   CHCR    PINC    FL_DMA_GetPeripheralIncrementMode
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_DECREASE
  */
__STATIC_INLINE uint32_t FL_DMA_GetPeripheralIncrementMode(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, (0x3U << 4U)) >> 4U);
    }
    return 0;
}

/**
  * @brief    DMA Double Buffering enable
  * @rmtoll   CHCR    DBUF    FL_DMA_EnableDoubleBuffering
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_EnableDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk);
    }
}

/**
  * @brief    Get DMA Double Buffering enable status
  * @rmtoll   CHCR    DBUF    FL_DMA_IsEnabledDoubleBuffering
  * @param    DMAx DMA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_DMA_IsEnabledDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk) == DMA_CHCR_DBUF_Msk);
    }
    return 0;
}

/**
  * @brief    DMA Double Buffering disable
  * @rmtoll   CHCR    DBUF    FL_DMA_DisableDoubleBuffering
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_DisableDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk);
    }
}

/**
  * @brief    Channelx enable
  * @rmtoll   CHCR    EN    FL_DMA_EnableChannel
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_EnableChannel(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
        SET_BIT(Temp->DMA_CH7CR, DMA_CHCR_EN_Msk);
    }
}

/**
  * @brief    Get channelx enable status
  * @rmtoll   CHCR    EN    FL_DMA_IsEnabledChannel
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_DMA_IsEnabledChannel(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk) == DMA_CHCR_EN_Msk);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->DMA_CH7CR, DMA_CHCR_EN_Msk) == DMA_CHCR_EN_Msk);
    }
}

/**
  * @brief    Channelx disable
  * @rmtoll   CHCR    EN    FL_DMA_DisableChannel
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_DisableChannel(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
        CLEAR_BIT(Temp->DMA_CH7CR, DMA_CHCR_EN_Msk);
    }
}

/**
  * @brief    Set channelx transmission length
  * @rmtoll   CFGR    TSIZE    FL_DMA_WriteTransmissionSize
  * @param    DMAx DMA instance
  * @param    size
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_WriteTransmissionSize(DMA_Type *DMAx, uint32_t size, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[channel].CFGR, (0xffffU << 16U), (size << 16U));
    }
    else
    {
        MODIFY_REG(Temp->DMA_CH7CR, (0x1fffU << 16U), (size << 16U));
    }
}

/**
  * @brief    Get channelx transmission length
  * @rmtoll   CFGR    TSIZE    FL_DMA_ReadTransmissionSize
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval
  */
__STATIC_INLINE uint32_t FL_DMA_ReadTransmissionSize(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, (0xffffU << 16U)) >> 16U);
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->DMA_CH7CR, (0x1fffU << 16U)) >> 16U);
    }
}

/**
  * @brief    Channelx Suspend enable
  * @rmtoll   CFGR    SUSP    FL_DMA_EnableChannelSuspend
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_EnableChannelSuspend(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        SET_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk);
    }
}

/**
  * @brief    Get channelx Suspend enable status
  * @rmtoll   CFGR    SUSP    FL_DMA_IsEnabledChannelSuspend
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_DMA_IsEnabledChannelSuspend(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk) == DMA_CFGR_SUSP_Msk);
    }
    return 0;
}

/**
  * @brief    Channelx Suspend disable
  * @rmtoll   CFGR    SUSP    FL_DMA_DisableChannelSuspend
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_DisableChannelSuspend(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        CLEAR_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk);
    }
}

/**
  * @brief    Channelx request source select
  * @rmtoll   CFGR    RSEL    FL_DMA_SetPeripheralMap
  * @param    DMAx DMA instance
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_SPI0_RX
  *           @arg @ref FL_DMA_CHANNEL_SPI1_RX
  *           @arg @ref FL_DMA_CHANNEL_SPI2_RX
  *           @arg @ref FL_DMA_CHANNEL_SPI3_RX
  *           @arg @ref FL_DMA_CHANNEL_SPI0_TX
  *           @arg @ref FL_DMA_CHANNEL_SPI1_TX
  *           @arg @ref FL_DMA_CHANNEL_SPI2_TX
  *           @arg @ref FL_DMA_CHANNEL_SPI3_TX
  *           @arg @ref FL_DMA_CHANNEL_UART0_RX
  *           @arg @ref FL_DMA_CHANNEL_UART1_RX
  *           @arg @ref FL_DMA_CHANNEL_UART2_RX
  *           @arg @ref FL_DMA_CHANNEL_UART3_RX
  *           @arg @ref FL_DMA_CHANNEL_UART4_RX
  *           @arg @ref FL_DMA_CHANNEL_UART5_RX
  *           @arg @ref FL_DMA_CHANNEL_UART6_RX
  *           @arg @ref FL_DMA_CHANNEL_UART7_RX
  *           @arg @ref FL_DMA_CHANNEL_UART0_TX
  *           @arg @ref FL_DMA_CHANNEL_UART1_TX
  *           @arg @ref FL_DMA_CHANNEL_UART2_TX
  *           @arg @ref FL_DMA_CHANNEL_UART3_TX
  *           @arg @ref FL_DMA_CHANNEL_UART4_TX
  *           @arg @ref FL_DMA_CHANNEL_UART5_TX
  *           @arg @ref FL_DMA_CHANNEL_UART6_TX
  *           @arg @ref FL_DMA_CHANNEL_UART7_TX
  *           @arg @ref FL_DMA_CHANNEL_LPUART0_RX
  *           @arg @ref FL_DMA_CHANNEL_LPUART0_TX
  *           @arg @ref FL_DMA_CHANNEL_I2C_SMB0_R
  *           @arg @ref FL_DMA_CHANNEL_I2C_SMB1_R
  *           @arg @ref FL_DMA_CHANNEL_I2C_SMB0_T
  *           @arg @ref FL_DMA_CHANNEL_I2C_SMB1_T
  *           @arg @ref FL_DMA_CHANNEL_AES_IN
  *           @arg @ref FL_DMA_CHANNEL_AES_OUT
  *           @arg @ref FL_DMA_CHANNEL_CRC
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH1
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH2
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH3
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH4
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_TRIG
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_COM
  *           @arg @ref FL_DMA_CHANNEL_ATIM0_UEV
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_CH1
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_CH2
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_CH3
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_CH4
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_TRIG
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_COM
  *           @arg @ref FL_DMA_CHANNEL_ATIM1_UEV
  *           @arg @ref FL_DMA_CHANNEL_TAU0_0
  *           @arg @ref FL_DMA_CHANNEL_TAU0_1
  *           @arg @ref FL_DMA_CHANNEL_TAU0_2
  *           @arg @ref FL_DMA_CHANNEL_TAU0_3
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_CH1
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_CH2
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_CH3
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_CH4
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_TRI
  *           @arg @ref FL_DMA_CHANNEL_GPTIM0_UEV
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_CH1
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_CH2
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_CH3
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_CH4
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_TRI
  *           @arg @ref FL_DMA_CHANNEL_GPTIM1_UEV
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_CH1
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_CH2
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_CH3
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_CH4
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_TRI
  *           @arg @ref FL_DMA_CHANNEL_GPTIM2_UEV
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_CH1
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_CH2
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_CH3
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_CH4
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_TRI
  *           @arg @ref FL_DMA_CHANNEL_GPTIM3_UEV
  *           @arg @ref FL_DMA_CHANNEL_BSTIM0_TRI
  *           @arg @ref FL_DMA_CHANNEL_LPTIM0_TRI
  *           @arg @ref FL_DMA_CHANNEL_ADC0_REQ0
  *           @arg @ref FL_DMA_CHANNEL_ADC0_REQ1
  *           @arg @ref FL_DMA_CHANNEL_ADC0_REQ2
  *           @arg @ref FL_DMA_CHANNEL_ADC0_REQ3
  *           @arg @ref FL_DMA_CHANNEL_ADC0_REQ4
  *           @arg @ref FL_DMA_CHANNEL_ADC1_REQ0
  *           @arg @ref FL_DMA_CHANNEL_ADC1_REQ1
  *           @arg @ref FL_DMA_CHANNEL_ADC1_REQ2
  *           @arg @ref FL_DMA_CHANNEL_ADC1_REQ3
  *           @arg @ref FL_DMA_CHANNEL_ADC1_REQ4
  *           @arg @ref FL_DMA_CHANNEL_TAU1_0
  *           @arg @ref FL_DMA_CHANNEL_TAU1_1
  *           @arg @ref FL_DMA_CHANNEL_TAU1_2
  *           @arg @ref FL_DMA_CHANNEL_TAU1_3
  *           @arg @ref FL_DMA_CHANNEL_DAC0
  *           @arg @ref FL_DMA_CHANNEL_TAU2_0
  *           @arg @ref FL_DMA_CHANNEL_TAU2_1
  *           @arg @ref FL_DMA_CHANNEL_TAU2_2
  *           @arg @ref FL_DMA_CHANNEL_TAU2_3
  *           @arg @ref FL_DMA_CHANNEL_SWTRIG
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetPeripheralMap(DMA_Type *DMAx, uint32_t peripheral, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[channel].CFGR, DMA_CFGR_RSEL_Msk, peripheral << 8);
    }
}

