Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_dma.h
/**
  * @brief    Get channelx memory0 pointer address
  * @rmtoll   MEMAD0        FL_DMA_ReadMemoryAddress
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  *           @arg @ref FL_DMA_CHANNEL_7
  * @retval
  */
__STATIC_INLINE uint32_t FL_DMA_ReadMemoryAddress(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHMAD0, (0xffffffffU)));
    }
    else
    {
        return (uint32_t)(READ_BIT(Temp->CH7MAD, (0x3fffU)));
    }
}

/**
  * @brief    Set channelx memory1 pointer address
  * @rmtoll   MEMAD1        FL_DMA_WriteMemoryAddress1
  * @param    DMAx DMA instance
  * @param    data
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_WriteMemoryAddress1(DMA_Type *DMAx, uint32_t data, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->Channel[channel].CHMAD1, (0xffffffffU), (data));
    }
}

/**
  * @brief    Get channelx memory1 pointer address
  * @rmtoll   MEMAD1        FL_DMA_ReadMemoryAddress1
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval
  */
__STATIC_INLINE uint32_t FL_DMA_ReadMemoryAddress1(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->Channel[channel].CHMAD1, (0xffffffffU)));
    }
    return 0;
}

/**
  * @brief    Set Flash channel RAM address incremental
  * @rmtoll   DMA_CH7CR    RINC    FL_DMA_SetFlashMemoryIncrementMode

  * @param    DMAx DMA instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetFlashMemoryIncrementMode(DMA_Type *DMAx, uint32_t mode)
{
    MODIFY_REG(DMAx->CH7CR, DMA_DMA_CH7CR_RINC_Msk, mode);
}

/**
  * @brief    Get  Flash channel RAM address incremental status
  * @rmtoll   DMA_CH7CR    RINC    FL_DMA_GetFlashRamIncrementMode
  * @param    DMAx DMA instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
  */
__STATIC_INLINE uint32_t FL_DMA_GetFlashRamIncrementMode(DMA_Type *DMAx)
{
    return (uint32_t)(READ_BIT(DMAx->CH7CR, DMA_DMA_CH7CR_RINC_Msk) == DMA_DMA_CH7CR_RINC_Msk);
}

/**
  * @brief    Get  Flash channel RAM address incremental status
  * @rmtoll   DMA_CH7CR    FINC    FL_DMA_GetFlashAddrIncremental
  * @param    DMAx DMA instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
  */
__STATIC_INLINE uint32_t FL_DMA_GetFlashAddrIncremental(DMA_Type *DMAx)
{
    return (uint32_t)(READ_BIT(DMAx->CH7CR, DMA_DMA_CH7CR_FINC_Msk) == DMA_DMA_CH7CR_FINC_Msk);
}

/**
  * @brief    Set Flash channel RAM address incremental
  * @rmtoll   DMA_CH7CR    FINC    FL_DMA_SetFlashAddrIncremental

  * @param    DMAx DMA instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CH7_FLASH_INC_MODE_INCREASE
  *           @arg @ref FL_DMA_CH7_FLASH_INC_MODE_DECREASE
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetFlashAddrIncremental(DMA_Type *DMAx, uint32_t mode)
{
    MODIFY_REG(DMAx->CH7CR, DMA_DMA_CH7CR_FINC_Msk, mode);
}

/**
  * @brief    DMA address error interrupt enable
  * @rmtoll   DMA_GCR    ADDRERR_IE    FL_DMA_EnableIT_AddressError
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_EnableIT_AddressError(DMA_Type *DMAx)
{
    SET_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk);
}                     

/**
  * @brief    Get DMA address error interrupt enable status
  * @rmtoll   DMA_GCR    ADDRERR_IE    FL_DMA_IsEnabledIT_AddressError
  * @param    DMAx DMA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_DMA_IsEnabledIT_AddressError(DMA_Type *DMAx)
{
    return (uint32_t)(READ_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk) == DMA_GCR_ADDRERR_IE_Msk);
}

/**
  * @brief    DMA address error interrupt disable
  * @rmtoll   DMA_GCR    ADDRERR_IE    FL_DMA_DisableIT_AddressError
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_DisableIT_AddressError(DMA_Type *DMAx)
{
    CLEAR_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk);
}

/**
  * @brief    DMA enable
  * @rmtoll   DMA_GCR    EN    FL_DMA_Enable
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_Enable(DMA_Type *DMAx)
{
    SET_BIT(DMAx->GCR, DMA_GCR_EN_Msk);
}

/**
  * @brief    Get DMA enable status
  * @rmtoll   DMA_GCR    EN    FL_DMA_IsEnabled
  * @param    DMAx DMA instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_DMA_IsEnabled(DMA_Type *DMAx)
{
    return (uint32_t)(READ_BIT(DMAx->GCR, DMA_GCR_EN_Msk) == DMA_GCR_EN_Msk);
}

/**
  * @brief    DMA disable
  * @rmtoll   DMA_GCR    EN    FL_DMA_Disable
  * @param    DMAx DMA instance
  * @retval   None
  */
__STATIC_INLINE void FL_DMA_Disable(DMA_Type *DMAx)
{
    CLEAR_BIT(DMAx->GCR, DMA_GCR_EN_Msk);
}

/**
  * @brief    Set channelx soft trigger
  * @rmtoll   SWRR      SWTRING     FL_DMA_SetChannelxSoftTrigger
  * @param    DMAx DMA instance
  * @param    data This parameter can be one of the following values:
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_0
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_1
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_2
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_3
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_4
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_5
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_6
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6

  * @retval   None
  */
__STATIC_INLINE void FL_DMA_SetChannelxSoftTrigger(DMA_Type *DMAx, uint32_t data, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        MODIFY_REG(Temp->SWRR, (0x3fU), (data));
    }
}

/**
  * @brief    Get channelx soft trigger status
  * @rmtoll   SWRR      SWTRING     FL_DMA_GetChannelxSoftTrigger
  * @param    DMAx DMA instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_DMA_CHANNEL_0
  *           @arg @ref FL_DMA_CHANNEL_1
  *           @arg @ref FL_DMA_CHANNEL_2
  *           @arg @ref FL_DMA_CHANNEL_3
  *           @arg @ref FL_DMA_CHANNEL_4
  *           @arg @ref FL_DMA_CHANNEL_5
  *           @arg @ref FL_DMA_CHANNEL_6
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_0
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_1
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_2
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_3
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_4
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_5
  *           @arg @ref FL_DMA_TRIGGER_CHANNEL_6
  */
__STATIC_INLINE uint32_t FL_DMA_GetChannelxSoftTrigger(DMA_Type *DMAx, uint32_t channel)
{
    DMA_ADDR  *Temp = (DMA_ADDR *)DMAx;
    if(channel <= FL_DMA_CHANNEL_6)
    {
        return (uint32_t)(READ_BIT(Temp->SWRR, (0x3fU)));
    }
    return 0;

